askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012.menu.22_updipin.02_resetalt.bootloader.reset_bit=11
tinyAVR012.menu.22_updipin.02_resetalt=PA0 pin=UPDI and PB4 pin=RESET (tinyAVR-2 20/24pin only)
tinyAVR012.menu.22_updipin.10_separator=-
tinyAVR012.menu.22_updipin.11_reset.bootloader.reset_bit=10
tinyAVR012.menu.22_updipin.11_reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
tinyAVR012.menu.22_updipin.12_gpio.bootloader.reset_bit=00
tinyAVR012.menu.22_updipin.12_gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)
tinyAVR012.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
tinyAVR012.menu.24_eeprom.01_keep=Save guard "Retained"
tinyAVR012.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
tinyAVR012.menu.24_eeprom.02_erase=Save guard "Erase"
tinyAVR012.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
tinyAVR012.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
tinyAVR012.menu.24_eeprom.03_upload="Erase" and "Replace"
tinyAVR012.menu.26_userrow.02_keep=Save guard "Retained"
tinyAVR012.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
tinyAVR012.menu.26_userrow.03_upload=Upload ".urow" file
tinyAVR012.menu.51_buildopt.01_Release=Build Release (default)
tinyAVR012.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
tinyAVR012.menu.51_buildopt.02_Debug1=Build DEBUG=1
tinyAVR012.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
tinyAVR012.menu.51_buildopt.03_Debug2=Build DEBUG=2
tinyAVR012.menu.52_macroapi.01_Enable=Macro API Enable (default)
tinyAVR012.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
tinyAVR012.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
tinyAVR012.menu.52_macroapi.03_Disable.build.macroapi=
tinyAVR012.menu.52_macroapi.03_Disable=Macro API Disable
tinyAVR012.menu.52_macroapi.04_AllDisable.build.macroapi=
tinyAVR012.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
tinyAVR012.menu.52_macroapi.04_AllDisable=Standard Library All Disable
tinyAVR012.menu.53_printf.01_default=default
tinyAVR012.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
tinyAVR012.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
tinyAVR012.menu.53_printf.02_full=Float Support
tinyAVR012.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
tinyAVR012.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
tinyAVR012.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
tinyAVR012.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
tinyAVR012.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
tinyAVR012.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
tinyAVR012.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
tinyAVR012.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
tinyAVR012.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
tinyAVR012.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
tinyAVR012.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
tinyAVR012.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
tinyAVR012.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
tinyAVR012.menu.90_console_baud.20_separator=-
tinyAVR012.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
tinyAVR012.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
tinyAVR012.menu.95_bootloader.01_UART0_B2_LA7.bootloader.file=hex/boot_attiny_UART0_B2_{upload.speed}_LA7.hex
tinyAVR012.menu.95_bootloader.01_UART0_B2_LA7.build.console_select=-DSerial=Serial0A
tinyAVR012.menu.95_bootloader.01_UART0_B2_LA7=UART0 TX:PB2 RX:PB3 LED=PA7 (default)
tinyAVR012.menu.95_bootloader.11_UART0_A1_LA7_.bootloader.file=hex/boot_attiny_UART0_A1_{upload.speed}_LA7.hex
tinyAVR012.menu.95_bootloader.11_UART0_A1_LA7_.build.console_select=-DSerial=Serial1A
tinyAVR012.menu.95_bootloader.11_UART0_A1_LA7_=UART0 TX:PA1 RX:PA2 LED=PA7 (alternative)
tinyAVR012.menu.95_bootloader.20_separator=-
tinyAVR012.menu.95_bootloader.21_UART1_C2_LA7.bootloader.file=hex/boot_attiny_UART1_C2_{upload.speed}_LA7.hex
tinyAVR012.menu.95_bootloader.21_UART1_C2_LA7.build.console_select=-DSerial=Serial1B
tinyAVR012.menu.95_bootloader.21_UART1_C2_LA7=UART1 TX:PC2 RX:PC1 LED=PA7 (tinyAVR-2 20/24pin only)


tinyAVR01.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR01.bootloader.BOOTSIZE=0x02
tinyAVR01.bootloader.CODESIZE=0x00
tinyAVR01.bootloader.OSCCFG=0b01111110
tinyAVR01.bootloader.SYSCFG0=0b1101{bootloader.reset_bit}1{bootloader.eesave_bit}
tinyAVR01.bootloader.SYSCFG1=0b11111111
tinyAVR01.bootloader.WDTCFG=0b00000000
tinyAVR01.bootloader.bod_lvl=000
tinyAVR01.bootloader.bod_mode=00
tinyAVR01.bootloader.bod_sample=0
tinyAVR01.bootloader.eepupload=
tinyAVR01.bootloader.urowupload=
tinyAVR01.bootloader.fuseupload={bootloader.fuses}
tinyAVR01.bootloader.eesave_bit=1
tinyAVR01.bootloader.reset_bit=10
tinyAVR01.bootloader.tool=avrdude
tinyAVR01.bootloader.programed_type=.with_bootloader
tinyAVR01.build.export_merged_output=true
tinyAVR01.build.text_section_start=.text=0x200
tinyAVR01.build.buildopt=-DNDEBUG
tinyAVR01.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR01.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR01.build.macroapi=-DENABLE_MACRO_API
tinyAVR01.build.printf=
tinyAVR01.build.printflt=
tinyAVR01.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
tinyAVR01.upload.protocol=arduino
tinyAVR01.upload.speed=115200
tinyAVR01.upload.tool=avrdude
tinyAVR01.menu.01_variant.61_ATtiny412.build.board=AVR_ATTINY412
tinyAVR01.menu.01_variant.61_ATtiny412.build.mcu=attiny412
tinyAVR01.menu.01_variant.61_ATtiny412.build.variant=tinyAVR1_8
tinyAVR01.menu.01_variant.61_ATtiny412.upload.maximum_data_size=256
tinyAVR01.menu.01_variant.61_ATtiny412.upload.maximum_size=3584
tinyAVR01.menu.01_variant.61_ATtiny412=tinyAVR-1 8pin ATtiny412 (4KiB+256B)
tinyAVR01.menu.01_variant.62_ATtiny212.build.board=AVR_ATTINY212
tinyAVR01.menu.01_variant.62_ATtiny212.build.mcu=attiny212
tinyAVR01.menu.01_variant.62_ATtiny212.build.variant=tinyAVR1_8
tinyAVR01.menu.01_variant.62_ATtiny212.upload.maximum_data_size=128
tinyAVR01.menu.01_variant.62_ATtiny212.upload.maximum_size=1536
tinyAVR01.menu.01_variant.62_ATtiny212=tinyAVR-1 8pin ATtiny212 (2KiB+128B)
tinyAVR01.menu.01_variant.A0_separator=-
tinyAVR01.menu.01_variant.A1_ATtiny402.build.board=AVR_ATTINY402
tinyAVR01.menu.01_variant.A1_ATtiny402.build.mcu=attiny402
tinyAVR01.menu.01_variant.A1_ATtiny402.build.variant=tinyAVR0_8
tinyAVR01.menu.01_variant.A1_ATtiny402.upload.maximum_data_size=256
tinyAVR01.menu.01_variant.A1_ATtiny402.upload.maximum_size=3584
tinyAVR01.menu.01_variant.A1_ATtiny402=tinyAVR-0 8pin ATtiny402 (4KiB+256B)
tinyAVR01.menu.01_variant.A2_ATtiny202.build.board=AVR_ATTINY202
tinyAVR01.menu.01_variant.A2_ATtiny202.build.mcu=attiny202
tinyAVR01.menu.01_variant.A2_ATtiny202.build.variant=tinyAVR0_8
tinyAVR01.menu.01_variant.A2_ATtiny202.upload.maximum_data_size=128
tinyAVR01.menu.01_variant.A2_ATtiny202.upload.maximum_size=1536
tinyAVR01.menu.01_variant.A2_ATtiny202=tinyAVR-0 8pin ATtiny202 (2KiB+128B)
tinyAVR01.menu.02_clock.01_20MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.01_20MHz.build.f_cpu=20000000L
tinyAVR01.menu.02_clock.01_20MHz=Internal 20 MHz
tinyAVR01.menu.02_clock.02_10MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.02_10MHz.build.f_cpu=10000000L
tinyAVR01.menu.02_clock.02_10MHz=Internal 10 MHz
tinyAVR01.menu.02_clock.03_5MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.03_5MHz.build.f_cpu=5000000L
tinyAVR01.menu.02_clock.03_5MHz=Internal 5 MHz
tinyAVR01.menu.02_clock.10_separator=-
tinyAVR01.menu.02_clock.11_16MHz.bootloader.OSCCFG=0b00000001
tinyAVR01.menu.02_clock.11_16MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.11_16MHz.build.f_cpu=16000000L
tinyAVR01.menu.02_clock.11_16MHz=Internal 16 MHz
tinyAVR01.menu.02_clock.12_8MHz.bootloader.OSCCFG=0b00000001
tinyAVR01.menu.02_clock.12_8MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.12_8MHz.build.f_cpu=8000000L
tinyAVR01.menu.02_clock.12_8MHz=Internal 8 MHz
tinyAVR01.menu.02_clock.13_4MHz.bootloader.OSCCFG=0b00000001
tinyAVR01.menu.02_clock.13_4MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.13_4MHz.build.f_cpu=4000000L
tinyAVR01.menu.02_clock.13_4MHz=Internal 4 MHz
tinyAVR01.menu.02_clock.15_1MHz.bootloader.OSCCFG=0b00000001
tinyAVR01.menu.02_clock.15_1MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.15_1MHz.build.f_cpu=1000000L
tinyAVR01.menu.02_clock.15_1MHz=Internal 1 MHz
tinyAVR01.menu.02_clock.20_separator=-
tinyAVR01.menu.02_clock.21_2MHz.bootloader.bod_sample=0
tinyAVR01.menu.02_clock.21_2MHz.build.f_cpu=2000000L
tinyAVR01.menu.02_clock.21_2MHz=Internal 2 MHz
tinyAVR01.menu.02_clock.22_32768Hz.bootloader.bod_sample=1
tinyAVR01.menu.02_clock.22_32768Hz.build.f_cpu=32768
tinyAVR01.menu.02_clock.22_32768Hz=Internal 32.768 kHz (ULP)
tinyAVR01.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
tinyAVR01.menu.11_BODMODE.01_disabled=BOD Disabled
tinyAVR01.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
tinyAVR01.menu.11_BODMODE.02_enabled=BOD Enabled
tinyAVR01.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
tinyAVR01.menu.11_BODMODE.03_sampled=BOD Sampled
tinyAVR01.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
tinyAVR01.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
tinyAVR01.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
tinyAVR01.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
tinyAVR01.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
tinyAVR01.menu.12_BODLVL.BODLEVEL2=Level 2.6V
tinyAVR01.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
tinyAVR01.menu.12_BODLVL.BODLEVEL7=Level 4.3V
tinyAVR01.menu.22_updipin.01_updi.bootloader.reset_bit=01
tinyAVR01.menu.22_updipin.01_updi=PA0 pin=UPDI (default)
tinyAVR01.menu.22_updipin.10_separator=-
tinyAVR01.menu.22_updipin.11_reset.bootloader.reset_bit=10
tinyAVR01.menu.22_updipin.11_reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
tinyAVR01.menu.22_updipin.12_gpio.bootloader.reset_bit=00
tinyAVR01.menu.22_updipin.12_gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)
tinyAVR01.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
tinyAVR01.menu.24_eeprom.01_keep=Save guard "Retained"
tinyAVR01.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
tinyAVR01.menu.24_eeprom.02_erase=Save guard "Erase"
tinyAVR01.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
tinyAVR01.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
tinyAVR01.menu.24_eeprom.03_upload="Erase" and "Replace"
tinyAVR01.menu.26_userrow.02_keep=Save guard "Retained"
tinyAVR01.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
tinyAVR01.menu.26_userrow.03_upload=Upload ".urow" file
tinyAVR01.menu.51_buildopt.01_Release=Build Release (default)
tinyAVR01.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
tinyAVR01.menu.51_buildopt.02_Debug1=Build DEBUG=1
tinyAVR01.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
tinyAVR01.menu.51_buildopt.03_Debug2=Build DEBUG=2
tinyAVR01.menu.52_macroapi.01_Enable=Macro API Enable (default)
tinyAVR01.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
tinyAVR01.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
tinyAVR01.menu.52_macroapi.03_Disable.build.macroapi=
tinyAVR01.menu.52_macroapi.03_Disable=Macro API Disable
tinyAVR01.menu.52_macroapi.04_AllDisable.build.macroapi=
tinyAVR01.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
tinyAVR01.menu.52_macroapi.04_AllDisable=Standard Library All Disable
tinyAVR01.menu.53_printf.01_default=default
tinyAVR01.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
tinyAVR01.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
tinyAVR01.menu.53_printf.02_full=Float Support
tinyAVR01.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR01.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
tinyAVR01.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
tinyAVR01.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
tinyAVR01.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
tinyAVR01.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
tinyAVR01.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
tinyAVR01.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
tinyAVR01.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
tinyAVR01.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
tinyAVR01.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
tinyAVR01.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
tinyAVR01.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
tinyAVR01.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
tinyAVR01.menu.90_console_baud.20_separator=-
tinyAVR01.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
tinyAVR01.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
tinyAVR01.menu.95_bootloader.01_UART0_A6_LA3.bootloader.file=hex/boot_attiny_UART0_A6_{upload.speed}_LA3.hex
tinyAVR01.menu.95_bootloader.01_UART0_A6_LA3.build.console_select=-DSerial=Serial0A
tinyAVR01.menu.95_bootloader.01_UART0_A6_LA3=UART0 TX:PA6 RX:PA7 LED=PA3 (default)
tinyAVR01.menu.95_bootloader.11_UART0_A1_LA3.bootloader.file=hex/boot_attiny_UART0_A1_{upload.speed}_LA3.hex
tinyAVR01.menu.95_bootloader.11_UART0_A1_LA3.build.console_select=-DSerial=Serial0B
tinyAVR01.menu.95_bootloader.11_UART0_A1_LA3=UART0 TX:PA1 RX:PA2 LED=PA3 (alternative)


