askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
tinyAVR012_noloader.bootloader.BOOTSIZE=0x00
tinyAVR012_noloader.bootloader.CODESIZE=0x00
tinyAVR012_noloader.bootloader.OSCCFG=0b01111110
tinyAVR012_noloader.bootloader.SYSCFG0=0b1101{bootloader.reset_bit}1{bootloader.eesave_bit}
tinyAVR012_noloader.bootloader.SYSCFG1=0b11111111
tinyAVR012_noloader.bootloader.WDTCFG=0b00000000
tinyAVR012_noloader.bootloader.bod_lvl=000
tinyAVR012_noloader.bootloader.bod_mode=00
tinyAVR012_noloader.bootloader.bod_sample=0
tinyAVR012_noloader.bootloader.eepupload=
tinyAVR012_noloader.bootloader.urowupload=
tinyAVR012_noloader.bootloader.fuseupload={bootloader.fuses}
tinyAVR012_noloader.bootloader.eesave_bit=1
tinyAVR012_noloader.bootloader.reset_bit=10
tinyAVR012_noloader.bootloader.tool=avrdude
tinyAVR012_noloader.bootloader.file=empty/empty.hex
tinyAVR012_noloader.bootloader.programed_type=
tinyAVR012_noloader.build.console_select=
tinyAVR012_noloader.build.export_merged_output=false
tinyAVR012_noloader.build.text_section_start=.text=0x0
tinyAVR012_noloader.build.buildopt=-DNDEBUG
tinyAVR012_noloader.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012_noloader.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.build.macroapi=-DENABLE_MACRO_API
tinyAVR012_noloader.build.printf=
tinyAVR012_noloader.build.printflt=
tinyAVR012_noloader.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
tinyAVR012_noloader.upload.tool=
tinyAVR012_noloader.menu.01_variant.01_ATtiny3227.build.board=AVR_ATTINY3227
tinyAVR012_noloader.menu.01_variant.01_ATtiny3227.build.mcu=attiny3227
tinyAVR012_noloader.menu.01_variant.01_ATtiny3227.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.01_ATtiny3227.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.01_ATtiny3227.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.01_ATtiny3227.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.01_ATtiny3227=tinyAVR-2 24pin ATtiny3227 (32KiB+3KiB)
tinyAVR012_noloader.menu.01_variant.02_ATtiny1627.build.board=AVR_ATTINY1627
tinyAVR012_noloader.menu.01_variant.02_ATtiny1627.build.mcu=attiny1627
tinyAVR012_noloader.menu.01_variant.02_ATtiny1627.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.02_ATtiny1627.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.02_ATtiny1627.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.02_ATtiny1627=tinyAVR-2 24pin ATtiny1627 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.03_ATtiny827.build.board=AVR_ATTINY827
tinyAVR012_noloader.menu.01_variant.03_ATtiny827.build.mcu=attiny827
tinyAVR012_noloader.menu.01_variant.03_ATtiny827.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.03_ATtiny827.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.03_ATtiny827.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.03_ATtiny827=tinyAVR-2 24pin ATtiny827 (8KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.04_ATtiny427.build.board=AVR_ATTINY427
tinyAVR012_noloader.menu.01_variant.04_ATtiny427.build.mcu=attiny427
tinyAVR012_noloader.menu.01_variant.04_ATtiny427.build.variant=tinyAVR2_24
tinyAVR012_noloader.menu.01_variant.04_ATtiny427.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.04_ATtiny427.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.04_ATtiny427=tinyAVR-2 24pin ATtiny427 (4KiB+512B)
tinyAVR012_noloader.menu.01_variant.10_separator=-
tinyAVR012_noloader.menu.01_variant.11_ATtiny3226.build.board=AVR_ATTINY3226
tinyAVR012_noloader.menu.01_variant.11_ATtiny3226.build.mcu=attiny3226
tinyAVR012_noloader.menu.01_variant.11_ATtiny3226.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.11_ATtiny3226.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.11_ATtiny3226.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.11_ATtiny3226.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.11_ATtiny3226=tinyAVR-2 20pin ATtiny3226 (32KiB+3KiB)
tinyAVR012_noloader.menu.01_variant.12_ATtiny1626.build.board=AVR_ATTINY1626
tinyAVR012_noloader.menu.01_variant.12_ATtiny1626.build.mcu=attiny1626
tinyAVR012_noloader.menu.01_variant.12_ATtiny1626.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.12_ATtiny1626.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.12_ATtiny1626.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.12_ATtiny1626=tinyAVR-2 20pin ATtiny1626 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.13_ATtiny826.build.board=AVR_ATTINY826
tinyAVR012_noloader.menu.01_variant.13_ATtiny826.build.mcu=attiny826
tinyAVR012_noloader.menu.01_variant.13_ATtiny826.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.13_ATtiny826.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.13_ATtiny826.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.13_ATtiny826=tinyAVR-2 20pin ATtiny826 (8KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.14_ATtiny426.build.board=AVR_ATTINY426
tinyAVR012_noloader.menu.01_variant.14_ATtiny426.build.mcu=attiny426
tinyAVR012_noloader.menu.01_variant.14_ATtiny426.build.variant=tinyAVR2_20
tinyAVR012_noloader.menu.01_variant.14_ATtiny426.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.14_ATtiny426.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.14_ATtiny426=tinyAVR-2 20pin ATtiny426 (4KiB+512B)
tinyAVR012_noloader.menu.01_variant.20_separator=-
tinyAVR012_noloader.menu.01_variant.21_ATtiny3224.build.board=AVR_ATTINY3224
tinyAVR012_noloader.menu.01_variant.21_ATtiny3224.build.mcu=attiny3224
tinyAVR012_noloader.menu.01_variant.21_ATtiny3224.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.21_ATtiny3224.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.21_ATtiny3224.upload.maximum_data_size=3072
tinyAVR012_noloader.menu.01_variant.21_ATtiny3224.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.21_ATtiny3224=tinyAVR-2 14pin ATtiny3224 (32KiB+3KiB)
tinyAVR012_noloader.menu.01_variant.22_ATtiny1624.build.board=AVR_ATTINY1624
tinyAVR012_noloader.menu.01_variant.22_ATtiny1624.build.mcu=attiny1624
tinyAVR012_noloader.menu.01_variant.22_ATtiny1624.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.22_ATtiny1624.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.22_ATtiny1624.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.22_ATtiny1624=tinyAVR-2 14pin ATtiny1624 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.23_ATtiny824.build.board=AVR_ATTINY824
tinyAVR012_noloader.menu.01_variant.23_ATtiny824.build.mcu=attiny824
tinyAVR012_noloader.menu.01_variant.23_ATtiny824.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.23_ATtiny824.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.23_ATtiny824.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.23_ATtiny824=tinyAVR-2 14pin ATtiny824 (8KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.24_ATtiny424.build.board=AVR_ATTINY424
tinyAVR012_noloader.menu.01_variant.24_ATtiny424.build.mcu=attiny424
tinyAVR012_noloader.menu.01_variant.24_ATtiny424.build.variant=tinyAVR2_14
tinyAVR012_noloader.menu.01_variant.24_ATtiny424.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.24_ATtiny424.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.24_ATtiny424=tinyAVR-2 14pin ATtiny424 (4KiB+512B)
tinyAVR012_noloader.menu.01_variant.30_separator=-
tinyAVR012_noloader.menu.01_variant.31_ATtiny3217.build.board=AVR_ATTINY3217
tinyAVR012_noloader.menu.01_variant.31_ATtiny3217.build.mcu=attiny3217
tinyAVR012_noloader.menu.01_variant.31_ATtiny3217.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.31_ATtiny3217.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.31_ATtiny3217.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.31_ATtiny3217.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.31_ATtiny3217=tinyAVR-1 24pin ATtiny3217 (32KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.32_ATtiny1617.build.board=AVR_ATTINY1617
tinyAVR012_noloader.menu.01_variant.32_ATtiny1617.build.mcu=attiny1617
tinyAVR012_noloader.menu.01_variant.32_ATtiny1617.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.32_ATtiny1617.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.32_ATtiny1617.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.32_ATtiny1617=tinyAVR-1 24pin ATtiny1617 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.33_ATtiny817.build.board=AVR_ATTINY817
tinyAVR012_noloader.menu.01_variant.33_ATtiny817.build.mcu=attiny817
tinyAVR012_noloader.menu.01_variant.33_ATtiny817.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.33_ATtiny817.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.33_ATtiny817.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.33_ATtiny817=tinyAVR-1 24pin ATtiny817 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.34_ATtiny417.build.board=AVR_ATTINY417
tinyAVR012_noloader.menu.01_variant.34_ATtiny417.build.mcu=attiny417
tinyAVR012_noloader.menu.01_variant.34_ATtiny417.build.variant=tinyAVR1_24
tinyAVR012_noloader.menu.01_variant.34_ATtiny417.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.34_ATtiny417.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.34_ATtiny417=tinyAVR-1 24pin ATtiny417 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.40_separator=-
tinyAVR012_noloader.menu.01_variant.41_ATtiny3216.build.board=AVR_ATTINY3216
tinyAVR012_noloader.menu.01_variant.41_ATtiny3216.build.mcu=attiny3216
tinyAVR012_noloader.menu.01_variant.41_ATtiny3216.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.41_ATtiny3216.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p128.x
tinyAVR012_noloader.menu.01_variant.41_ATtiny3216.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.41_ATtiny3216.upload.maximum_size=32768
tinyAVR012_noloader.menu.01_variant.41_ATtiny3216=tinyAVR-1 20pin ATtiny3216 (32KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.42_ATtiny1616.build.board=AVR_ATTINY1616
tinyAVR012_noloader.menu.01_variant.42_ATtiny1616.build.mcu=attiny1616
tinyAVR012_noloader.menu.01_variant.42_ATtiny1616.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.42_ATtiny1616.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.42_ATtiny1616.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.42_ATtiny1616=tinyAVR-1 20pin ATtiny1616 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.43_ATtiny816.build.board=AVR_ATTINY816
tinyAVR012_noloader.menu.01_variant.43_ATtiny816.build.mcu=attiny816
tinyAVR012_noloader.menu.01_variant.43_ATtiny816.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.43_ATtiny816.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.43_ATtiny816.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.43_ATtiny816=tinyAVR-1 20pin ATtiny816 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.44_ATtiny416.build.board=AVR_ATTINY416
tinyAVR012_noloader.menu.01_variant.44_ATtiny416.build.mcu=attiny416
tinyAVR012_noloader.menu.01_variant.44_ATtiny416.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.44_ATtiny416.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.44_ATtiny416.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.44_ATtiny416=tinyAVR-1 20pin ATtiny416 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.45_ATtiny416auto.build.board=AVR_ATTINY416
tinyAVR012_noloader.menu.01_variant.45_ATtiny416auto.build.mcu=attiny416auto
tinyAVR012_noloader.menu.01_variant.45_ATtiny416auto.build.variant=tinyAVR1_20
tinyAVR012_noloader.menu.01_variant.45_ATtiny416auto.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.45_ATtiny416auto.upload.maximum_size=3584
tinyAVR012_noloader.menu.01_variant.45_ATtiny416auto=tinyAVR-1 20pin ATtiny416auto (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.50_separator=-
tinyAVR012_noloader.menu.01_variant.51_ATtiny1614.build.board=AVR_ATTINY1614
tinyAVR012_noloader.menu.01_variant.51_ATtiny1614.build.mcu=attiny1614
tinyAVR012_noloader.menu.01_variant.51_ATtiny1614.build.variant=tinyAVR1_14
tinyAVR012_noloader.menu.01_variant.51_ATtiny1614.upload.maximum_data_size=2048
tinyAVR012_noloader.menu.01_variant.51_ATtiny1614.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.51_ATtiny1614=tinyAVR-1 14pin ATtiny1614 (16KiB+2KiB)
tinyAVR012_noloader.menu.01_variant.52_ATtiny814.build.board=AVR_ATTINY814
tinyAVR012_noloader.menu.01_variant.52_ATtiny814.build.mcu=attiny814
tinyAVR012_noloader.menu.01_variant.52_ATtiny814.build.variant=tinyAVR1_14
tinyAVR012_noloader.menu.01_variant.52_ATtiny814.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.52_ATtiny814.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.52_ATtiny814=tinyAVR-1 14pin ATtiny814 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.53_ATtiny414.build.board=AVR_ATTINY414
tinyAVR012_noloader.menu.01_variant.53_ATtiny414.build.mcu=attiny414
tinyAVR012_noloader.menu.01_variant.53_ATtiny414.build.variant=tinyAVR1_14
tinyAVR012_noloader.menu.01_variant.53_ATtiny414.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.53_ATtiny414.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.53_ATtiny414=tinyAVR-1 14pin ATtiny414 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.60_separator=-
tinyAVR012_noloader.menu.01_variant.61_ATtiny412.build.board=AVR_ATTINY412
tinyAVR012_noloader.menu.01_variant.61_ATtiny412.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.61_ATtiny412.build.mcu=attiny412
tinyAVR012_noloader.menu.01_variant.61_ATtiny412.build.variant=tinyAVR1_8
tinyAVR012_noloader.menu.01_variant.61_ATtiny412.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.61_ATtiny412.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.61_ATtiny412=tinyAVR-1 8pin ATtiny412 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.62_ATtiny212.build.board=AVR_ATTINY212
tinyAVR012_noloader.menu.01_variant.62_ATtiny212.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.62_ATtiny212.build.mcu=attiny212
tinyAVR012_noloader.menu.01_variant.62_ATtiny212.build.variant=tinyAVR1_8
tinyAVR012_noloader.menu.01_variant.62_ATtiny212.upload.maximum_data_size=128
tinyAVR012_noloader.menu.01_variant.62_ATtiny212.upload.maximum_size=2048
tinyAVR012_noloader.menu.01_variant.62_ATtiny212=tinyAVR-1 8pin ATtiny212 (2KiB+128B)
tinyAVR012_noloader.menu.01_variant.70_separator=-
tinyAVR012_noloader.menu.01_variant.71_ATtiny1607.build.board=AVR_ATTINY1607
tinyAVR012_noloader.menu.01_variant.71_ATtiny1607.build.mcu=attiny1607
tinyAVR012_noloader.menu.01_variant.71_ATtiny1607.build.variant=tinyAVR0_24
tinyAVR012_noloader.menu.01_variant.71_ATtiny1607.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.71_ATtiny1607.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.71_ATtiny1607=tinyAVR-0 24pin ATtiny1607 (16KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.72_ATtiny807.build.board=AVR_ATTINY807
tinyAVR012_noloader.menu.01_variant.72_ATtiny807.build.mcu=attiny807
tinyAVR012_noloader.menu.01_variant.72_ATtiny807.build.variant=tinyAVR0_24
tinyAVR012_noloader.menu.01_variant.72_ATtiny807.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.72_ATtiny807.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.72_ATtiny807=tinyAVR-0 24pin ATtiny807 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.80_separator=-
tinyAVR012_noloader.menu.01_variant.81_ATtiny1606.build.board=AVR_ATTINY1606
tinyAVR012_noloader.menu.01_variant.81_ATtiny1606.build.mcu=attiny1606
tinyAVR012_noloader.menu.01_variant.81_ATtiny1606.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.81_ATtiny1606.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.81_ATtiny1606.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.81_ATtiny1606=tinyAVR-0 20pin ATtiny1606 (16KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.82_ATtiny806.build.board=AVR_ATTINY806
tinyAVR012_noloader.menu.01_variant.82_ATtiny806.build.mcu=attiny806
tinyAVR012_noloader.menu.01_variant.82_ATtiny806.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.82_ATtiny806.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.82_ATtiny806.upload.maximum_size=8192
tinyAVR012_noloader.menu.01_variant.82_ATtiny806=tinyAVR-0 20pin ATtiny806 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.83_ATtiny406.build.board=AVR_ATTINY406
tinyAVR012_noloader.menu.01_variant.83_ATtiny406.build.mcu=attiny406
tinyAVR012_noloader.menu.01_variant.83_ATtiny406.build.variant=tinyAVR0_20
tinyAVR012_noloader.menu.01_variant.83_ATtiny406.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.83_ATtiny406.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.83_ATtiny406=tinyAVR-0 20pin ATtiny406 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.90_separator=-
tinyAVR012_noloader.menu.01_variant.91_ATtiny1604.build.board=AVR_ATTINY1604
tinyAVR012_noloader.menu.01_variant.91_ATtiny1604.build.mcu=attiny1604
tinyAVR012_noloader.menu.01_variant.91_ATtiny1604.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.91_ATtiny1604.upload.maximum_data_size=1024
tinyAVR012_noloader.menu.01_variant.91_ATtiny1604.upload.maximum_size=16384
tinyAVR012_noloader.menu.01_variant.91_ATtiny1604=tinyAVR-0 14pin ATtiny1604 (16KiB+1KiB)
tinyAVR012_noloader.menu.01_variant.92_ATtiny804.build.board=AVR_ATTINY804
tinyAVR012_noloader.menu.01_variant.92_ATtiny804.build.mcu=attiny804
tinyAVR012_noloader.menu.01_variant.92_ATtiny804.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.92_ATtiny804.upload.maximum_data_size=512
tinyAVR012_noloader.menu.01_variant.92_ATtiny804.upload.maximum_size=8192
