askn37/multix-zinnia-sdk-megaAVR/boards.txt
tinyAVR012_noloader.menu.01_variant.92_ATtiny804=tinyAVR-0 14pin ATtiny804 (8KiB+512B)
tinyAVR012_noloader.menu.01_variant.93_ATtiny404.build.board=AVR_ATTINY404
tinyAVR012_noloader.menu.01_variant.93_ATtiny404.build.mcu=attiny404
tinyAVR012_noloader.menu.01_variant.93_ATtiny404.build.variant=tinyAVR0_14
tinyAVR012_noloader.menu.01_variant.93_ATtiny404.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.93_ATtiny404.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.93_ATtiny404=tinyAVR-0 14pin ATtiny404 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.A0_separator=-
tinyAVR012_noloader.menu.01_variant.A1_ATtiny402.build.board=AVR_ATTINY402
tinyAVR012_noloader.menu.01_variant.A1_ATtiny402.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.A1_ATtiny402.build.mcu=attiny402
tinyAVR012_noloader.menu.01_variant.A1_ATtiny402.build.variant=tinyAVR0_8
tinyAVR012_noloader.menu.01_variant.A1_ATtiny402.upload.maximum_data_size=256
tinyAVR012_noloader.menu.01_variant.A1_ATtiny402.upload.maximum_size=4096
tinyAVR012_noloader.menu.01_variant.A1_ATtiny402=tinyAVR-0 8pin ATtiny402 (4KiB+256B)
tinyAVR012_noloader.menu.01_variant.A2_ATtiny202.build.board=AVR_ATTINY202
tinyAVR012_noloader.menu.01_variant.A2_ATtiny202.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.01_variant.A2_ATtiny202.build.mcu=attiny202
tinyAVR012_noloader.menu.01_variant.A2_ATtiny202.build.variant=tinyAVR0_8
tinyAVR012_noloader.menu.01_variant.A2_ATtiny202.upload.maximum_data_size=128
tinyAVR012_noloader.menu.01_variant.A2_ATtiny202.upload.maximum_size=1536
tinyAVR012_noloader.menu.01_variant.A2_ATtiny202=tinyAVR-0 8pin ATtiny202 (2KiB+128B)
tinyAVR012_noloader.menu.02_clock.01_20MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.01_20MHz.build.f_cpu=20000000L
tinyAVR012_noloader.menu.02_clock.01_20MHz=Internal 20 MHz
tinyAVR012_noloader.menu.02_clock.02_10MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.02_10MHz.build.f_cpu=10000000L
tinyAVR012_noloader.menu.02_clock.02_10MHz=Internal 10 MHz
tinyAVR012_noloader.menu.02_clock.03_5MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.03_5MHz.build.f_cpu=5000000L
tinyAVR012_noloader.menu.02_clock.03_5MHz=Internal 5 MHz
tinyAVR012_noloader.menu.02_clock.10_separator=-
tinyAVR012_noloader.menu.02_clock.11_16MHz.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.11_16MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.11_16MHz.build.f_cpu=16000000L
tinyAVR012_noloader.menu.02_clock.11_16MHz=Internal 16 MHz
tinyAVR012_noloader.menu.02_clock.12_8MHz.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.12_8MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.12_8MHz.build.f_cpu=8000000L
tinyAVR012_noloader.menu.02_clock.12_8MHz=Internal 8 MHz
tinyAVR012_noloader.menu.02_clock.13_4MHz.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.13_4MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.13_4MHz.build.f_cpu=4000000L
tinyAVR012_noloader.menu.02_clock.13_4MHz=Internal 4 MHz
tinyAVR012_noloader.menu.02_clock.15_1MHz.bootloader.OSCCFG=0b00000001
tinyAVR012_noloader.menu.02_clock.15_1MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.15_1MHz.build.f_cpu=1000000L
tinyAVR012_noloader.menu.02_clock.15_1MHz=Internal 1 MHz
tinyAVR012_noloader.menu.02_clock.20_separator=-
tinyAVR012_noloader.menu.02_clock.21_2MHz.bootloader.bod_sample=0
tinyAVR012_noloader.menu.02_clock.21_2MHz.build.f_cpu=2000000L
tinyAVR012_noloader.menu.02_clock.21_2MHz=Internal 2 MHz
tinyAVR012_noloader.menu.02_clock.22_32768Hz.bootloader.bod_sample=1
tinyAVR012_noloader.menu.02_clock.22_32768Hz.build.f_cpu=32768
tinyAVR012_noloader.menu.02_clock.22_32768Hz=Internal 32.768 kHz (ULP)
tinyAVR012_noloader.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
tinyAVR012_noloader.menu.11_BODMODE.01_disabled=BOD Disabled
tinyAVR012_noloader.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
tinyAVR012_noloader.menu.11_BODMODE.02_enabled=BOD Enabled
tinyAVR012_noloader.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
tinyAVR012_noloader.menu.11_BODMODE.03_sampled=BOD Sampled
tinyAVR012_noloader.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
tinyAVR012_noloader.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.8V (default)
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.6V
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL7.bootloader.bod_lvl=111
tinyAVR012_noloader.menu.12_BODLVL.BODLEVEL7=Level 4.3V
tinyAVR012_noloader.menu.22_updipin.01_updi.bootloader.reset_bit=01
tinyAVR012_noloader.menu.22_updipin.01_updi=PA0 pin=UPDI (default)
tinyAVR012_noloader.menu.22_updipin.02_resetalt.bootloader.reset_bit=11
tinyAVR012_noloader.menu.22_updipin.02_resetalt=PA0 pin=UPDI and PB4 pin=RESET (tinyAVR-2 20/24pin only)
tinyAVR012_noloader.menu.22_updipin.10_separator=-
tinyAVR012_noloader.menu.22_updipin.11_reset.bootloader.reset_bit=10
tinyAVR012_noloader.menu.22_updipin.11_reset=PA0 pin=Reset (DANGER:NOT RECOMMENDED)
tinyAVR012_noloader.menu.22_updipin.12_gpio.bootloader.reset_bit=00
tinyAVR012_noloader.menu.22_updipin.12_gpio=PA0 pin=GPIO (DANGER:NOT RECOMMENDED)
tinyAVR012_noloader.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
tinyAVR012_noloader.menu.24_eeprom.01_keep=Save guard "Retained"
tinyAVR012_noloader.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
tinyAVR012_noloader.menu.24_eeprom.02_erase=Save guard "Erase"
tinyAVR012_noloader.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
tinyAVR012_noloader.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
tinyAVR012_noloader.menu.24_eeprom.03_upload=Upload ".eep" file
tinyAVR012_noloader.menu.26_userrow.02_keep=Save guard "Retained"
tinyAVR012_noloader.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
tinyAVR012_noloader.menu.26_userrow.03_upload=Upload ".urow" file
tinyAVR012_noloader.menu.27_fusefile.01_menu=Specify in the MENU
tinyAVR012_noloader.menu.27_fusefile.03_upload.bootloader.fuseupload={bootloader.fusefile}
tinyAVR012_noloader.menu.27_fusefile.03_upload=Upload ".fuse" file (DANGER)
tinyAVR012_noloader.menu.51_buildopt.01_Release=Build Release (default)
tinyAVR012_noloader.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
tinyAVR012_noloader.menu.51_buildopt.02_Debug1=Build DEBUG=1
tinyAVR012_noloader.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
tinyAVR012_noloader.menu.51_buildopt.03_Debug2=Build DEBUG=2
tinyAVR012_noloader.menu.52_macroapi.01_Enable=Macro API Enable (default)
tinyAVR012_noloader.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
tinyAVR012_noloader.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
tinyAVR012_noloader.menu.52_macroapi.03_Disable.build.macroapi=
tinyAVR012_noloader.menu.52_macroapi.03_Disable=Macro API Disable
tinyAVR012_noloader.menu.52_macroapi.04_AllDisable.build.macroapi=
tinyAVR012_noloader.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
tinyAVR012_noloader.menu.52_macroapi.04_AllDisable=Standard Library All Disable
tinyAVR012_noloader.menu.53_printf.01_default=default
tinyAVR012_noloader.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
tinyAVR012_noloader.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
tinyAVR012_noloader.menu.53_printf.02_full=Float Support
tinyAVR012_noloader.menu.54_console_select.01_UART0_B2_LA7.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.01_UART0_B2_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.menu.54_console_select.01_UART0_B2_LA7=UART0 TX:PB2 RX:PB3 LED=PA7
tinyAVR012_noloader.menu.54_console_select.02_UART0_A1_LA7.build.console_select=-DSerial=Serial0B
tinyAVR012_noloader.menu.54_console_select.02_UART0_A1_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.menu.54_console_select.02_UART0_A1_LA7=UART0 TX:PA1 RX:PA2 LED=PA7 (alternative)
tinyAVR012_noloader.menu.54_console_select.03_UART1_A1_LA7.build.console_select=-DSerial=Serial1A
tinyAVR012_noloader.menu.54_console_select.03_UART1_A1_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.menu.54_console_select.03_UART1_A1_LA7=UART1 TX:PA1 RX:PA2 LED=PA7 (tinyAVR-2)
tinyAVR012_noloader.menu.54_console_select.04_UART1_C2_LA7.build.console_select=-DSerial=Serial1B
tinyAVR012_noloader.menu.54_console_select.04_UART1_C2_LA7.build.led_pin=-DLED_BUILTIN=PIN_PA7
tinyAVR012_noloader.menu.54_console_select.04_UART1_C2_LA7=UART1 TX:PC2 RX:PC1 LED=PA7 (tinyAVR-2 alt)
tinyAVR012_noloader.menu.54_console_select.10_separator=-
tinyAVR012_noloader.menu.54_console_select.11_UART0_A6_LA3.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.11_UART0_A6_LA3.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.54_console_select.11_UART0_A6_LA3=UART0 TX:PA6 RX:PA7 LED=PA3 (8pin)
tinyAVR012_noloader.menu.54_console_select.12_UART0_A1_LA3.build.console_select=-DSerial=Serial0B
tinyAVR012_noloader.menu.54_console_select.12_UART0_A1_LA3.build.led_pin=-DLED_BUILTIN=PIN_PA3
tinyAVR012_noloader.menu.54_console_select.12_UART0_A1_LA3=UART0 TX:PA1 RX:PA2 LED=PA3 (8pin)
tinyAVR012_noloader.menu.54_console_select.20_separator=-
tinyAVR012_noloader.menu.54_console_select.21_UART0_A1_LB5_SB4_XplainedNano.build.console_select=-DSerial=Serial0B
tinyAVR012_noloader.menu.54_console_select.21_UART0_A1_LB5_SB4_XplainedNano.build.led_pin=-DLED_BUILTIN=PIN_PB5 -DSW_BUILTIN=PIN_PB4
tinyAVR012_noloader.menu.54_console_select.21_UART0_A1_LB5_SB4_XplainedNano=UART0 TX:PA1 RX:PA2 LED=PB5 SW=PB4 (ATtiny416 Xplained Nano)
tinyAVR012_noloader.menu.54_console_select.22_UART0_B2_LC0_SC5_XplainedMini.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.22_UART0_B2_LC0_SC5_XplainedMini.build.led_pin=-DLED_BUILTIN=PIN_PC0 -DSW_BUILTIN=PIN_PC5
tinyAVR012_noloader.menu.54_console_select.22_UART0_B2_LC0_SC5_XplainedMini=UART0 TX:PB2 RX:PB3 LED=PC0 SW=PC5 (ATtiny817 Xplained Mini)
tinyAVR012_noloader.menu.54_console_select.23_UART0_B2_LC7_SB5_XplainedPro.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.23_UART0_B2_LC7_SB5_XplainedPro.build.led_pin=-DLED_BUILTIN=PIN_PC7 -DSW_BUILTIN=PIN_PB5
tinyAVR012_noloader.menu.54_console_select.23_UART0_B2_LC7_SB5_XplainedPro=UART0 TX:PB2 RX:PB3 LED=PC7 SW=PB5 (ATtiny817/3217 Xplained Pro)
tinyAVR012_noloader.menu.54_console_select.24_UART0_B2_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.24_UART0_B2_LF5_SF6_Curiosity.build.led_pin=-DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6
tinyAVR012_noloader.menu.54_console_select.24_UART0_B2_LF5_SF6_Curiosity=UART0 TX:PB2 RX:PB3 LED=PF5 SW=PF6 (ATtiny1607 Curiosity Nano)
tinyAVR012_noloader.menu.54_console_select.25_UART0_B2_LA3_SB7_Curiosity.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.25_UART0_B2_LA3_SB7_Curiosity.build.led_pin=-DLED_BUILTIN=PIN_PA3 -DSW_BUILTIN=PIN_PB7
tinyAVR012_noloader.menu.54_console_select.25_UART0_B2_LA3_SB7_Curiosity=UART0 TX:PB2 RX:PA3 LED=PA3 SW=PB7 (ATtiny3217 Curiosity Nano)
tinyAVR012_noloader.menu.54_console_select.26_UART0_B2_LB7_SC4_Curiosity.build.console_select=-DSerial=Serial0A
tinyAVR012_noloader.menu.54_console_select.26_UART0_B2_LB7_SC4_Curiosity.build.led_pin=-DLED_BUILTIN=PIN_PB7 -DSW_BUILTIN=PIN_PC4
tinyAVR012_noloader.menu.54_console_select.26_UART0_B2_LB7_SC4_Curiosity=UART0 TX:PB2 RX:PB3 LED=PB7 SW=PC4 (ATtiny1627 Curiosity Nano)
tinyAVR012_noloader.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
tinyAVR012_noloader.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
tinyAVR012_noloader.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
tinyAVR012_noloader.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
tinyAVR012_noloader.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
tinyAVR012_noloader.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
tinyAVR012_noloader.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
tinyAVR012_noloader.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
tinyAVR012_noloader.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
tinyAVR012_noloader.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
tinyAVR012_noloader.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
tinyAVR012_noloader.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
tinyAVR012_noloader.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
tinyAVR012_noloader.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
tinyAVR012_noloader.menu.90_console_baud.20_separator=-
tinyAVR012_noloader.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
tinyAVR012_noloader.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
tinyAVR012_noloader.menu.95_bootloader.01_woBootloader=without Bootloader


